# Списъци

# Дефиниране

mylist = ["hello","world", 45, 30]

# Особености на списъците:
# Елементите са подредени, започвайки от 0
# Елементите могат да им се променя стойността им
# Позволява дублиране на стойности
# Елементите могат да бъдат от различен тип

print(mylist)

# Достъп до елементите - чрез индекс или slice

print(mylist[1][3]) # Извежда l (Двумерно записване)
# print(mylist[2][3]) дава грешка защото не може да се зема символи от целочислен тип

# Промяна на стойност на елемент

mylist[2] = 54 # Работи смяна по този начин

print(mylist)

# Промяна на повече от един елемент

mylist[2:4] = [25,23] # Така се сменят няколко елемента на веднъж
# Или се добавят нови

print(mylist)

# Добавяне на елемент В списък

mylist.insert(2,60) # Вкарва го преди избрания елемент и ги избутва надясно
#mylist.insert(2,[60,50]) # Става списък в списък
print(mylist)

# Добавяне на елемент КЪМ списък

mylist.append("python") # Добавя в края на списъка
print(mylist)

#mylist[10] = 23 Не може ако няма този индекс
#print(mylist)

# Разширяване на един списък с друг

list1 = [23,56,1,67]
mylist.extend(list1)

print(mylist)

# Премахване на елемент от списък

mylist.remove("python")
print(mylist)

# Премахване на елемент от списък с посочен индекс

mylist.pop(1)
print(mylist)

# Премахване на елемент от списък с pop без посочен индекс - маха последния елемент

mylist.pop()
print(mylist)

# Изтриване на целия списък

del mylist # Del - Изтрива цялата променливата
print(mylist) 