# Оператори в Python

# Аритметични
# + - * / % ** //

print(2 ** 10) # Степенуване
print(35 // 4) # Връща 8 - тоест най близкото до делението 4x8=32

# Оператори за присвояване

# = += -= *= /= %= //=

x = 5
x %= 3  # x = x % 3
print(x)

# Оператори за сравнение

# == != > < >= <= 

# Логически оператори

# and or not

# Оператори за идентичност

# is - Връща истина, ако двете променливи са един и същ обект

list1 = ["hello","world"]
list2 = ["hello","world"]
list3 = list1

print(list1 is list3) #Връща True защото са еднакви променливи/обект

print(list1 is list2) #Връща False защото не сочат към еднакви променливи/обект

print(list1 == list2) #Връща True защото проверяваме съдържание а не обект/променлива

# Оператори за принадлежност

# in        not in

print("hello" in list1) # Ако hello е в list1 ако има такъв връща True
# print("hello3" in list1) hello3 го няма в list1 заради това връща False

print("hello3" not in list1) # Връща True защото питаме за отрицание на in