"""
Tuples
Харастеристики на Tuple:
- подредена структура
- позволява дублиране на стойности
- НЕ позволява промяна на стойностите на елементите (като read-only)
- Позволява елементи с различен тип данни
"""

# Дефиниране на tuple

mytuple = (1,3,44,52,"Ivo")
print(mytuple)

# Определяне на дължината на tuple с len

print(len(mytuple))

tup1 = ("first") # Дава го като str
print(type(tup1))

tup2 = ("first",) # Дава го като tuple
print(type(tup2))

# Създаване на tuple с конструктор

tup3 = tuple(("first",23,45)) #Трябва да има 2 скоби

print(tup3[1]) # започват от 0 както при списъците

print(tup3[-1]) # Започват от -1 (наобратно)

print(mytuple[1:3]) # Чрез Slice,извежда (3,44)

 # Проверка за наличност на елемент 

 #if "first" in tup3: # Not in също е вариант
 #	print("Yes")

# tup3[0] = 12 # Не става сменяне на стойностите/присвояване

