"""
5. даден е следния списък
mylist = [2,33,46,12,56,38,23,49,28,74]
да се намери и изведе максималната стойност на списъка.
"""

mylist = [2,33,46,12,56,38,23,49,28,74]
#Верния подход - пълно обхождане
max1 = mylist[0]
for item in range(1,len(mylist)):
	if mylist[item]>max1:
		max1 = mylist[item]
print(max1)

"""
#Втори начин - чрез сортиране
mylist2=mylist.copy() #За да е отделно и да може да се сравнява
mylist.sort()
print(mylist[-1])
mylist = mylist2.copy() # Ако искаме да копираме новото в старото
del mylist2 # Да разкараме копието което не ни е нужно вече
"""
